# Pand

In [1]:
import pandas as pd
import numpy as np

In [2]:
dic={"names":["alex","sam","ahmed","sara"],"lesson1":[100,40,67,88],"lesson2":[90,80,77,87],"lesson3":[77,90,67,88],"lesson4":[88,80,64,32]}

In [3]:
df=pd.DataFrame(dic)

In [4]:
df

   names  lesson1  lesson2  lesson3  lesson4
0   alex      100       90       77       88
1    sam       40       80       90       80
2  ahmed       67       77       67       64
3   sara       88       87       88       32

In [5]:
df.head(2)

  names  lesson1  lesson2  lesson3  lesson4
0  alex      100       90       77       88
1   sam       40       80       90       80

In [6]:
df.tail(2)

   names  lesson1  lesson2  lesson3  lesson4
2  ahmed       67       77       67       64
3   sara       88       87       88       32

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    4 non-null      object
 1   lesson1  4 non-null      int64
 2   lesson2  4 non-null      int64
 3   lesson3  4 non-null      int64
 4   lesson4  4 non-null      int64
dtypes: int64(4), object(1)
memory usage: 288.0+ bytes

In [8]:
df.describe()

          lesson1    lesson2    lesson3    lesson4
count    4.000000   4.000000   4.000000   4.000000
mean    73.750000  83.500000  80.500000  66.000000
std     26.310644   6.027714  10.661457  24.765567
min     40.000000  77.000000  67.000000  32.000000
25%     60.250000  79.250000  74.500000  56.000000
50%     77.500000  83.500000  82.500000  72.000000
75%     91.000000  87.750000  88.500000  82.000000
max    100.000000  90.000000  90.000000  88.000000

In [9]:
df["pass"]=None

In [10]:
np.min(df.iloc[1,1:])

40

In [11]:
df.iloc[:,3]

0    77
1    90
2    67
3    88
Name: lesson3, dtype: int64

In [12]:
df["pass"]=df.apply(lambda x:np.min(x[1:-1].to_numpy()>50) ,axis=1)
df

   names  lesson1  lesson2  lesson3  lesson4   pass
0   alex      100       90       77       88   True
1    sam       40       80       90       80  False
2  ahmed       67       77       67       64   True
3   sara       88       87       88       32  False

In [13]:
df.iloc[0,5]="a"

In [14]:
df

   names  lesson1  lesson2  lesson3  lesson4   pass
0   alex      100       90       77       88      a
1    sam       40       80       90       80  False
2  ahmed       67       77       67       64   True
3   sara       88       87       88       32  False

In [15]:
df["avg"]=None

In [16]:
df

   names  lesson1  lesson2  lesson3  lesson4   pass   avg
0   alex      100       90       77       88      a  None
1    sam       40       80       90       80  False  None
2  ahmed       67       77       67       64   True  None
3   sara       88       87       88       32  False  None

In [17]:
def avg(x):
    if x[-2]==True:
              return  np.mean(x[1:-2].to_numpy())
    else:
        return None

In [18]:
df["avg"]=df.apply(avg,axis=1)

In [19]:
df

   names  lesson1  lesson2  lesson3  lesson4   pass    avg
0   alex      100       90       77       88      a    NaN
1    sam       40       80       90       80  False    NaN
2  ahmed       67       77       67       64   True  68.75
3   sara       88       87       88       32  False    NaN

In [20]:
df2=pd.DataFrame({"AGE":[22,32,22,11]})
df2

   AGE
0   22
1   32
2   22
3   11

In [21]:
 df=pd.concat([df,df2],axis=1)

In [22]:
df["buyuk_yas"] = [each*2 for each in df.AGE]
df

   names  lesson1  lesson2  lesson3  lesson4   pass    avg  AGE  buyuk_yas
0   alex      100       90       77       88      a    NaN   22         44
1    sam       40       80       90       80  False    NaN   32         64
2  ahmed       67       77       67       64   True  68.75   22         44
3   sara       88       87       88       32  False    NaN   11         22

In [23]:
df=df.drop("AGE",axis=1)

In [24]:
df.dropna()

   names  lesson1  lesson2  lesson3  lesson4  pass    avg  buyuk_yas
2  ahmed       67       77       67       64  True  68.75         44